content/about.md
+++
title = "Hongrui Cui"
author = ["Hongrui Cui"]
date = 2024-02-27T00:00:00+08:00
type = "page"
draft = false
[menu]
  [menu.about]
    identifier = "hongrui-cui"
    weight = 6
    name = "About"
+++

<span class="icons-item"> <a href="https://github.com/freemanrickcui" target="_blank"><i class="fab fa-github"></i></a></span>
<span class="icons-item"> <a href="https://www.stackoverflow.com/users/8865477/rick-freeman" target="_blank"><i class="fab fa-stack-overflow fa-1x"></i></a></span>
<span class="icons-item"> <a href="https://orcid.org/0000-0002-6203-413X" target="_blank"><i class="fab fa-orcid fa-1x"></i></a></span>
<span class="icons-item"> <a href="https://scholar.google.com/citations?user=bWNvN0UAAAAJ" target="_blank"><i class="fab fa-google fa-1x"></i></a></span>
<span class="icons-item"> <a href="mailto:freemanrickcui@outlook.com"><i class="fas fa-envelope fa-1x"></i></a></span>
<span class="icons-item"> <a href="/gpg_public_key.txt"><i class="fas fa-key fa-1x"></i></a></span>

Ph.D. Student in Cryptography<br />
[LATTICE Group, Shanghai Jiao Tong University](https://crypto.sjtu.edu.cn/)


## Interests {#interests}

-   Theoretical Cryptography
-   Multiparty Computation
-   MPC-in-the-Head


## Education {#education}

-   MSc in Computer Science, Shanghai Jiao Tong University, 2022
-   BSc in Information Security, Shanghai Jiao Tong University, 2019


## About {#about}

I am a second-year Ph.D. student majoring in Cryptography at SJTU. My
past projects include MPC-in-the-Head, COT-AG, and ReSolveD. I am very
interested in objects that are both theoretically interesting and of
practical significance.
